[
  {
    "t": "Only two other people (besides me) know that I am the Intrusive Thinker. Should I kill them to keep this fully anonymous? Should I be the only one who knows?",
    "d": "Feb 8, 2026 3:15 pm"
  },
  {
    "t": "Walking to the post office, and overheard a nurse telling her coworkers that she used to be a massage therapist. Do you want to massage my dick with your coochie?",
    "d": "Feb 4, 2026 1:00 pm"
  },
  {
    "t": "My roommate's bisexual. If I put my dick in his mouth while he was asleep, would he like it? Would he swallow my cum, as he did with the four dicks he's previously sucked?",
    "d": "Feb 3, 2026 7:42 pm"
  },
  {
    "t": "Walking home from work, spotted a chick with a nice pair of tits; unfortunately, they were protected by a bright pink, and quite pretty, knitted sweater. “Excuse me, miss!” I wanted to say. “Can I liberate your breasts from the prison of your outfit?”",
    "d": "Feb 3, 2026 6:55 pm"
  },
  {
    "t": "Could cum be used as window cleaning fluid? Or would that just fuck up the wipers? #curious",
    "d": "Feb 3, 2026 6:36 pm"
  },
  {
    "t": "Another interesting sighting on the walk to work: really fat lady, could easily roll downhill, with an exposed belly (why?) that I really wanted to pat and say, “You really earned that one, didn’t you!”",
    "d": "Feb 3, 2026 9:19 am"
  },
  {
    "t": "Saw some reallllllllly jiggly tits on my walk to work today, she wasn’t wearing a bra and the bounciness of those things would’ve made a full-suspension mountain bike jealous. Bless 🙏",
    "d": "Feb 3, 2026 9:16 am"
  },
  {
    "t": "Just saw a Waymo run over dog shit and spread it all over the road. Mmmmmmmmmmmmm 😋. I wonder if the Waymo ran over the dog, too.",
    "d": "Feb 3, 2026 9:10 am"
  },
  {
    "t": "Just saw an Arab woman walking down the street. What if I just blew my nose into her hijab?",
    "d": "Feb 2, 2026 12:25 pm"
  },
  {
    "t": "Got off the train and saw a lovely woman with a ~beautiful~ ass in black flare leggings. I’m so down bad",
    "d": "Feb 2, 2026 12:22 pm"
  },
  {
    "t": "Got off the train and saw a lovely woman with a ~beautiful~ ass in black flare leggings. I’m so down bad",
    "d": "Feb 2, 2026 12:22 pm"
  },
  {
    "t": "Saw possibly the most attractive blonde I’ve ever seen at a brunch spot yesterday, sitting outside with her friend. Perfect long hair and smooth skin. Lovely bazookas begging to be held, her shirt straining to keep them in. Hips wide, made to be caressed; ass shapely and round, simply dissolving in her chair. Just when I thought it couldn’t get any better, she put on some seductively sexy library glasses. Jesus Christ. I just wish she were sitting on my cock instead, me burying my face in her tits. The curves on some of these women make me believe in God.",
    "d": "Feb 2, 2026 11:55 am"
  },
  {
    "t": "I saw her standing while sitting at the airport gate, waiting for the flight to board. It'd been delayed once, then delayed again, then delayed a third time. I didn't mind, because it gave me some more time to just look at her. God, was she something to look at. She was wearing an all-brown outfit, and boy, I didn't know all-brown could look so nice on someone. Nice hoodie, matching flare leggings that left little of her shape to imagination. God damn, I've always had a thing for flare leggings, they drive me crazy. She was a ginger, hair like fire, though it wasn't one color; every strand a different shade, red and gold and something in-between, looking truly like fire itself, bouncing and weaving when she walked like the flames of a campfire on a late summer evening, perfectly matching the beautiful brown of her clothes. She was with a friend, joking for minutes, and her smile just made me want to melt right into my seat. She boarded Group 5; I, Group 7. Gave me a good reason to just stare as she walked by and subtly stare some more as I walked by myself. 5 rows ahead, that's all. Plenty close to look at her hair the entire flight, her head just peeking out over her seat. Alas. Another counterfactual girlfriend, existing nowhere but in my imagination.",
    "d": "Feb 1, 2026 8:17 pm"
  },
  {
    "t": "I was calling someone while waiting for the plane to fill up, and was told that it was a bold decision to talk so loudly around other people. Yes, it's a bold decision, but bold is what I write my signature in.",
    "d": "Feb 1, 2026 8:05 pm"
  },
  {
    "t": "So many cute girls at the beach today, god damn. There was one group of 6 that had such perfect asses, tight colorful bikinis, and were full of energy and cheer. Wish they could be full of my cum, too. Only issue is that they're all almost certainly 15.",
    "d": "Feb 1, 2026 4:36 pm"
  },
  {
    "t": "The only thing that can contend with the present is the past or an imagined future.",
    "d": "Feb 1, 2026 4:25 pm"
  },
  {
    "t": "Just saw a really hot chick at the beach hit a vape. Attractiveness instantly lowered. I thought, \"Instead of sucking the vape, why don't you suck my dick?\"",
    "d": "Feb 1, 2026 3:31 pm"
  },
  {
    "t": "What if I literally just killed everyone in this coffee shop right now. It wouldn't even really be that hard. There's a basic-ass looking white dude, mid-life crisis-having for sure, with a 6/10 Asian girlfriend with a 9/10 ass with him, and I literally can just grab a pair of scissors, stab him through the eye, and kidnap her. It wouldn't even be that hard.",
    "d": "Feb 1, 2026 1:43 pm"
  }
]